{"title":"About Me","slug":"About-Me","date":"2023-04-09T12:38:52.000Z","updated":"2023-04-09T13:16:08.465Z","comments":true,"path":"api/articles/About-Me.json","photos":[],"link":"","excerpt":" [Figure] Perhaps you would like to know me...","covers":["/2023/04/09/About-Me/dyf_home.jpeg"],"content":"<img src=\"/2023/04/09/About-Me/dyf_home.jpeg\" class=\"\" title=\"[cover]\">\n\n<center>Perhaps you would like to know me...</center>\n\n<span id=\"more\"></span>\n\n<p>My name is Dong Yifei. From 2017 to 2021, I obtained a Bachelor’s degree in Mechanical Design, Manufacturing and Automation from Southwest Jiaotong University. During this period, I received comprehensive scholarships and the Merit Student Honor Award every year, and participated in many beneficial competitions and activities.  In 2021, I obtained the recommendation qualification and chose to join <a href=\"http://www.adv-ci.com/blog/\">Professor Bu’s team</a> to work on SLAM and 3D reconstruction related projects. During this period, I participated in some research and projects, constantly improving my research and engineering skills. I also took time to participate in some mathematical modeling and UAV-related competitions with my colleagues. Some of my work can be found in other articles on this webpage.</p>\n<p>For navigation and 3D reconstruction problems, traditional methods have gradually evolved into engineering problems. From this perspective, single sensors are inevitably encountering difficult scenarios that are hard to solve, such as degenerate scenes, dynamic scenes, and so on.  Thus, increasing the number of sensors and allowing complementary advantages of sensors with different characteristics is a good consideration. Currently, multi-sensor fusion algorithms attempt to combine various sensors such as cameras, lidars, IMUs, GNSS, magnetometers, mmWave radars, event cameras, sonars, and even thermal imaging sensors. The methods in this area are becoming increasingly engineering-oriented, but this does not necessarily reduce the difficulty of these tasks.</p>\n<p>With the impressive capabilities of ChatGPT, I am gradually beginning to believe that in the fields of navigation and reconstruction, large-scale end-to-end deep learning models may be the way of the future. There have been increasing attempts to combine deep learning methods with SLAM in recent years, such as incorporating attention mechanisms, using semantic segmentation to handle dynamic scenes, and implementing higher quality feature point extraction and matching through deep learning. While deep learning methods have shown promising results in SLAM, deploying them in real-world applications may still require utilizing the features of C++. </p>\n<p>In the future, I hope to conduct research in the fields of computer vision, robot state estimation, 3D reconstruction, and other related areas. I believe that I already have a good foundation in mathematics and programming, and I have enough self-motivation to pursue research in these areas. If there is a Ph.D. position available in your team, please feel free to contact me. You can find my email address at the bottom of my homepage. Looking forward to hearing from you.</p>\n","categories":[],"tags":[]}